Repository: dolca/myCV
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ro

source: Junior Web Developer, Entrepreneur and Real Estate Consultant with a passion for technology and innovation. Strong experience in web development, automating administrative tasks and effective team collaboration. Graduate of the Software Development Academy, specialized in Python and hands-on experience in Django, SQL and web application development.
ro: Dezvoltator Web Junior, Antreprenor și Consultant Imobiliar cu o pasiune pentru tehnologie și inovație. Experiență puternică în dezvoltarea web, automatizarea sarcinilor administrative și colaborarea eficientă în echipă. Absolvent al ”Software Development Academy”, specializat în Python și experiență practică în Django, SQL și dezvoltare de aplicații web.

source: web development, automation, real estate consultant, entrepreneurship, musician, team collaboration, problem-solving, creativity
ro: dezvoltare web, automatizare, consultant imobiliar, antreprenoriat, muzician, colaborare in echipa, rezolvare de probleme, creativitate

source: Home
ro: Acasă

source: About
ro: Despre

source: Resume
ro: Rezumat

source: Portfolio
ro: Portofoliu

source: Services
ro: Servicii

source: English
ro: Engleză

source: Romanian
ro: Română

source: I'm
ro: Sunt

source: Junior Web Developer
ro: Dezvoltator Web Junior

source: Entrepreneur
ro: Antreprenor

source: Real Estate Consultant
ro: Consultant Imobiliar

source: Musician
ro: Muzician

source: I define myself as a person who develops and evolves through hard work and a passion for continuous learning. I am meticulous in organization, detail-oriented and an effective collaborator, adding value to any team due to my excellent communication and collaboration skills.
ro: Mă definesc ca o persoană care se dezvoltă și evoluează prin muncă asiduă și pasiune pentru învățarea continuă. Sunt meticulos în organizare, orientat spre detalii și un colaborator eficient, adăugând valoare oricărei echipe datorită abilităților mele excelente de comunicare și colaborare.

source: Everything goes exactly the way you want it to, when you don't know you can't.
ro: Totul merge exact așa cum îți dorești, atunci când nu știi că nu poți.

source: Birthday
ro: Zi de naștere

source: 1 October 1991
ro: 1 Octombrie 1991

source: Age
ro: Vârstă

source: Courses
ro: Cursuri

source: Romania
ro: România

source: Degree
ro: Studii

source: University
ro: Universitare

source: Phone
ro: Telefon

source: Current City
ro: Oraș actual

source: Freelance
ro: Colaborare

source: Available
ro: Disponibil

source: I am an open and empathetic person, able to understand and connect with different perspectives and find smart solutions in complex situations. I like challenges and aim to approach them with optimism and determination, seeing every obstacle as an opportunity for personal growth and development. I am confident in my abilities to come up with new ideas and find innovative solutions.
ro: Sunt o persoană deschisă și empatică, capabilă să înțeleagă și să se conecteze cu diferite perspective și să găsească soluții inteligente în situații complexe. Îmi plac provocările și îmi propun să le abordez cu optimism și determinare, văzând fiecare obstacol ca pe o oportunitate de creștere și dezvoltare personală. Am încredere în abilitățile mele de a veni cu idei noi și de a găsi soluții inovatoare.

source: Facts
ro: Date

source: I have a passion for creativity and innovation, always looking to combine traditional solutions with fresh and unconventional ideas to solve the situations I face. I am an enthusiast of interdisciplinary collaboration and exchange of ideas, believing that diversity of perspectives brings value and innovation to any project.
ro: Am o pasiune pentru creativitate și inovație, căutând mereu să combin soluțiile tradiționale cu idei noi și neconvenționale pentru a rezolva situațiile cu care mă confrunt. Sunt un entuziast al colaborării interdisciplinare și al schimbului de idei, considerând că diversitatea de perspective aduce valoare și inovație oricărui proiect.

source: lines of code
ro: linii de cod

source: hours of coding
ro: ore de codare

source: personal projects
ro: proiecte personale

source: percent dedicated
ro: la sută dedicat

source: Skills
ro: Aptitudini

source: I am a results-oriented person with a pragmatic and practical approach to tasks and projects, always looking for effective and tangible solutions. I take responsibility and commitment in everything I do, always putting quality and excellence first and seeking to achieve my goals with determination and perseverance.
ro: Sunt o persoană orientată spre rezultate, cu o abordare pragmatică și practică a sarcinilor și proiectelor, mereu în căutarea unor soluții eficiente și tangibile. Îmi asum responsabilitatea și angajamentul în tot ceea ce fac, punând întotdeauna calitatea și excelența pe primul loc și căutând să-mi ating obiectivele cu determinare și perseverență.

source: SQL databases
ro: Baze de date SQL

source: I like to challenge myself and get out of my comfort zone, always looking to learn new things and constantly improve my skills in various areas.
ro: Îmi plac provocările și îmi place să ies din zona de confort, căutând mereu să învăț lucruri noi și să-mi îmbunătățesc constant abilitățile în diverse domenii.

source: Summary
ro: Sumar

source: Born in Sighetu Marmației, Maramureș, with solid principles, a meticulous approach and great attention to detail, I define myself as a dedicated perfectionist, motivated to achieve excellence in every aspect of my activities.
ro: Născut în Sighetu Marmației, Maramureș, cu principii solide, o abordare meticuloasă și o mare atenție la detalii, mă definesc ca un perfecționist dedicat, motivat să ating excelența în fiecare aspect al activităților mele.

source: Known Languages
ro: Limbi cunoscute

source: Pre-Intermediate
ro: Pre-intermediar

source: Italian
ro: Italiană

source: Elementary
ro: Elementar

source: Education
ro: Educație

source: Python from Scratch
ro: Python de la Zero

source: May 2023 - February 2024
ro: Mai 2023 - Februarie 2024

source: I learned to use the Python language and work with various technologies based on it, as well as manage code versions using the Git system and GitHub
ro: Am învățat să folosesc limbajul Python și să lucrez cu diverse tehnologii bazate pe acesta, precum și să gestionez versiunile de cod folosind sistemul Git și GitHub

source: I also gained practical knowledge in working with SQL databases, understanding their fundamental principles and how to interact with them
ro: De asemenea, am dobândit cunoștințe practice în lucrul cu baze de date SQL, înțelegând principiile lor fundamentale și cum să interacționez cu ele

source: In addition, I learned essential aspects of the HTTP protocol and acquired basic skills in developing and styling web pages using HTML, CSS and JavaScript
ro: În plus, am învățat aspecte esențiale ale protocolului HTTP și am dobândit abilități de bază în dezvoltarea și stilizarea paginilor web folosind HTML, CSS și JavaScript

source: I also explored the Django framework, which gave me a hands-on insight into web application development in Python, facilitating efficient database management and the creation of complex and scalable web applications
ro: De asemenea, am explorat arhitectura Django, care mi-a oferit o perspectivă practică asupra dezvoltării de aplicații web în Python, facilitând gestionarea eficientă a bazelor de date și crearea de aplicații web complexe și scalabile

source: Musical Pedagogy
ro: Pedagogie muzicală

source: October 2010 - July 2013
ro: Octombrie 2010 - Iulie 2013

source: National Academy of Music
ro: Academia Națională de Muzică

source: I acquired solid skills in planning and presenting lessons adapted to the individual needs of students, as well as in evaluating their musical progress
ro: Am dobândit abilități solide în planificarea și prezentarea lecțiilor adaptate nevoilor individuale ale elevilor, precum și în evaluarea progresului lor muzical

source: I also developed skills in managing classrooms and communicating effectively with students of different ages and skill levels, thereby facilitating a stimulating and inspiring learning environment
ro: De asemenea, am dezvoltat abilități în gestionarea sălilor de clasă și în comunicarea eficientă cu elevi de diferite vârste și niveluri de calificare, facilitând astfel un mediu de învățare stimulant și inspirator

source: Professional Experience
ro: Experiență profesională

source: November 2022 - Present
ro: Noiembrie 2022 - Prezent

source: Real Estate
ro: Imobiliare

source: Excellent communication skills, facilitating sales and purchase processes and assisting the team in achieving goals
ro: Abilități excelente de comunicare, facilitând procesele de vânzare și cumpărare și asistând echipa în atingerea obiectivelor

source: Strong leadership and the ability to motivate and guide team members to success by coaching and developing their sales skills
ro: Abilități solide de lider și capacitatea de a motiva și ghida membrii echipei către succes prin coaching și dezvoltarea abilităților lor de vânzări

source: Proactive and customer-oriented attitude, ensuring effective and attentive management of customer relationships and meeting their needs adequately
ro: Atitudine proactivă și orientată către client, asigurând un management eficient și atent al relațiilor cu clienții și satisfacerea adecvată a nevoilor acestora

source: Excellent organizational skills and attention to detail, ensuring efficient and accurate management of the financial and contractual aspects of the company
ro: Excelente abilități organizatorice și atenție la detalii, asigurând un management eficient și precis al aspectelor financiare și contractuale ale companiei

source: Real Estate Broker
ro: Broker imobiliar

source: October 2021 - October 2022
ro: Octombrie 2021 - Octombrie 2022

source: HoReCa Sales Agent
ro: Agent de vânzări HoReCa

source: October 2017 - February 2019
ro: Octombrie 2017 - Februarie 2019

source: Distribution
ro: Distribuție

source: Billing Clerk
ro: Operator facturare

source: December 2016 - June 2017
ro: Decembrie 2016 - Iunie 2017

source: I gained skills in managing invoices, issuing and organizing invoices for each vehicle and recording stock invoices in the database
ro: Am acumulat abilități în gestionarea facturilor, emițând și organizând facturile pentru fiecare vehicul și înregistrând facturile de stoc în baza de date

source: I gained knowledge in accounting management, recording invoices, payment orders and agent receipts for primary accounting
ro: Am acumulat cunoștințe în managementul contabilității, înregistrând facturile, ordinele de plată și chitanțele agenților pentru contabilitatea primară

source: Retail / HoReCa Sales Agent
ro: Agent de vânzări Retail / HoReCa

source: October 2014 - October 2016
ro: Octombrie 2014 - Octombrie 2016

source: I have acquired solid negotiation skills, working to expand the client portfolio and conclude contracts for easier achievement of monthly targets
ro: Am dobândit abilități solide de negociere, lucrând la extinderea portofoliului de clienți și încheierea de contracte pentru realizarea mai ușoară a obiectivelor lunare

source: I learned to collaborate effectively in a team, working together to help each other achieve our monthly objectives
ro: Am învățat să colaborez eficient în echipă, lucrând împreună pentru a ne ajuta reciproc să ne atingem obiectivele lunare

source: I excelled in organization, scheduling client visits based on the availability of decision makers and efficiently managing the collection of overdue invoices
ro: Am excelat în organizare, programând vizite la clienți în funcție de disponibilitatea factorilor de decizie și gestionând eficient încasarea facturilor restante

source: Passionate about every project I get involved in, my dedication and meticulous attention to every detail is evident. I leverage my creativity and technical skills to produce high quality results and continuously evolve in the area of web development.
ro: Pasionat de fiecare proiect în care mă implic, dăruirea și atenția mea meticuloasă la fiecare detaliu sunt evidente. Îmi valorific creativitatea și abilitățile tehnice pentru a produce rezultate de înaltă calitate și pentru a evolua continuu în domeniul dezvoltării web.

source: All
ro: Tot

source: Real Estate CRM
ro: CRM Imobiliar

source: Login Page
ro: Pagina de conectare

source: Authentication
ro: Autentificare

source: Leads Menu
ro: Meniu cereri

source: Sidebar
ro: Bara laterală

source: Customization Menu
ro: Meniu de personalizare

source: System Design Settings
ro: Setări design sistem

source: Horizontal Layout
ro: Aspect orizontal

source: Layouts
ro: Aspecte

source: Compact Vertical Layout
ro: Aspect vertical compact

source: Light Layout
ro: Aspect luminos

source: Leads
ro: Cereri

source: Dark Layout
ro: Aspect întunecat

source: Add New Lead Menu
ro: Meniu de adăugare cerere nouă

source: Add New Contact Modal
ro: Modal de adăugare contact nou

source: Create New Lead (Light Layout)
ro: Creează cerere nouă (Aspect luminos)

source: Create New Lead (Dark Layout)
ro: Creează cerere nouă (Aspect întunecat)

source: Change Password Page
ro: Pagina de schimbare a parolei

source: As a junior Python programmer, I make valuable contributions through web development, automation of administrative tasks and project assistance, increasing the efficiency and effectiveness of any organization's operations.
ro: În calitate de programator Python junior, aduc contribuții valoroase prin dezvoltarea web, automatizarea sarcinilor administrative și asistența la proiecte, crescând eficiența și eficacitatea operațiunilor oricărei organizații.

source: Website development and maintenance
ro: Dezvoltare și întreținere site

source: Creating and updating websites using frameworks like Django. These sites can include presentation pages, personal portfolios, online stores, etc.
ro: Creare și actualizare site-uri web folosind arhitecturi precum Django. Aceste site-uri pot include pagini de prezentare, portofolii personale, magazine online etc.

source: Automation of administrative tasks
ro: Automatizare sarcini administrative

source: Writing Python scripts to automate repetitive tasks within the organization such as processing files, extracting data from databases, generating automated reports, etc.
ro: Scriere de scripturi Python pentru automatizarea sarcinilor repetitive din cadrul organizației, cum ar fi procesarea fișierelor, extragerea datelor din baze de date, generarea de rapoarte automate etc.

source: Development of data analysis and reporting tools
ro: Dezvoltare instrumente de analiză și raportare a datelor

source: Creating scripts and programs to help with data analysis and processing, such as generating graphs, calculating statistics or manipulating CSV files
ro: Creare de scripturi și programe pentru a ajuta la analiza și procesarea datelor, cum ar fi generarea de grafice, calcularea statisticilor sau manipularea fișierelor CSV

source: Desktop application development
ro: Dezvoltare de aplicații desktop

source: Creating desktop applications to solve specific problems, such as task management applications, note-taking applications, file conversion applications, etc.
ro: Creare de aplicații desktop pentru a rezolva probleme specifice, cum ar fi aplicații de gestionare a sarcinilor, aplicații de luare notițe, aplicații de conversie a fișierelor etc.

source: Assist in the development of larger projects
ro: Asistență în dezvoltarea de proiecte mai mari

source: Providing support and help for more complex projects under the supervision of a senior programmer or mentor. This may include developing features, writing unit tests, troubleshooting code, etc.
ro: Oferirea de sprijin și ajutor pentru proiecte mai complexe sub supravegherea unui programator sau mentor senior. Acesta poate include dezvoltarea de funcții, scriere de teste unitare, cod de depanare etc.

source: Maintain and debug existing code
ro: Menținere și depanare cod existent

source: Ensuring existing code works correctly, identifying and fixing bugs, and improving code to meet new requirements and standards
ro: Asigurarea funcționării corecte a codului existent, identificarea și remedierea erorilor și îmbunătățirea codului pentru a îndeplini noile cerințe și standarde

source: Location
ro: Locație

source: Your Name
ro: Numele tău

source: Your E-mail
ro: Adresa de e-mail

source: Subject
ro: Subiect

source: Message
ro: Mesaj

source: Sending...
ro: Se trimite...

source: Something went wrong! Please try again or use another contact method.
ro: Ceva nu a funcționat bine! Te rog să încerci din nou sau să utilizezi o altă metodă de contact.

source: Your message has been sent successfully. I will reply as soon as possible. Thank you!
ro: Mesajul tău a fost trimis cu succes. Voi reveni cu un răspuns cât mai curând. Mulțumesc!

source: Send Message
ro: Trimite mesajul

source: Whether you think you can or you think you can't, you're right
ro: Fie că crezi că poți sau crezi că nu poți, ai dreptate

source: Copyright
ro: Drepturi de autor

source: All Rights Reserved
ro: Toate drepturile rezervate

source: Project Information
ro: Informații proiect

source: Category
ro: Categorie

source: Customer Relationship Management System
ro: Sistem de management al relațiilor cu clienții

source: Framework
ro: Arhitectură

source: An efficient real estate CRM, designed to facilitate the management of properties, requests, contacts and tasks, being an indispensable tool for real estate agents and professionals in the field.
ro: Un CRM imobiliar eficient, menit să faciliteze gestionarea proprietăților, cererilor, contactelor și sarcinilor, fiind un instrument indispensabil agenților imobiliari și profesioniștilor în domeniu.
